-- 1. Створити користувальницький тип даних для зберігання оцінки учня на основі стандартного типу tinyint з можливістю використання порожніх
-- значень.

-- 2. Створити об'єкт-замовчування (default) зі значенням 3.

-- 3. Зв'язати об'єкт-замовчування з призначеним для користувача типом даних для оцінки.

-- 4. Отримати інформацію про призначений для користувача тип даних.

-- 5. Створити об'єкт-правило (rule): a> = 1 і a <= 5 і зв'язати його з призначеним для користувача типом даних для оцінки.

-- 6. Створити таблицю "Успішність студента", використовуючи новий тип даних. У таблиці повинні бути оцінки студента з кількох предметів.

-- 7. Скасувати всі прив'язки і видалити з бази даних тип даних користувача, замовчування і правило.
