-- 1. Кількість тем може бути в діапазоні від 5 до 10.
DELIMITER //
CREATE TRIGGER trigger1 BEFORE INSERT ON book_topic
FOR EACH ROW
BEGIN
  IF (SELECT COUNT(*) FROM book_topic.topic) > 10
  THEN
    SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'Кількість тем більша 10';
  ELSEIF (select count(*) from book_topic.topic) < 5
  THEN
    SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT ='Кількість менша 5 ';
  END IF;
END; 
//
DELIMITER ;

-- 2. Новинкою може бути тільки книга видана в поточному році.

-- 3. Книга з кількістю сторінок до 100 не може коштувати більше 10 $, до 200 - 20 $, до 300 - 30 $.

-- 4. Видавництво "BHV" не випускає книги накладом меншим 5000, а видавництво Diasoft - 10000.

-- 5. Книги з однаковим кодом повинні мати однакові дані.

-- 6. При спробі видалення книги видається інформація про кількість видалених рядків. Якщо користувач не "dbo", то видалення забороняється.

-- 7. Користувач "dbo" не має права змінювати ціну книги.

-- 8. Видавництва ДМК і Еком підручники не видають.

-- 9. Видавництво не може випустити більше 10 новинок протягом одного місяця поточного року.

-- 10. Видавництво BHV не випускає книги формату 60х88 / 16.
