# 1. Проаналізувати приклад універсального відношення. З`ясувати які його колонки містять надлишкові дані. Виконати нормалізацію універсального відношення, розбивши його на кілька таблиць.
  
# 2. Скласти SQL-script, що виконує:
# a. Створення таблиць бази даних. Команди для створення таблиці повинні містити головний ключ, обмеження типу null / not null, default, check, створення зв`язків з умовами посилальної цілісності
  
# b. Завантаження даних в таблиці
  
# 3. Побудувати діаграму зв`язків таблиць бази даних використовуючи інструмент Designer.
  
# 4. Створити зв’язки в базі даних між таблицями.
# a. Вивчити роботу створення зв’язків між таблицями в полі Designer
  
# b. Створити майстром e Designer кілька варіантів зв’язків у базі даних
  
# c. Проаналізувати і пояснити особливості зв’язків, створених Designer
  
# d. Порівняти з тими, що написані самостійно.
  
# e. Зробити висновки
  
# 5. Створити і перевірити представлення для отримання універсального відношення з набору нормалізованих таблиць бази даних.
  
