-- 1. Вивести значення наступних колонок: назва книги, ціна, назва видавництва, формат.

-- 2. Вивести значення наступних колонок: тема, категорія, назва книги, назва видавництва. Фільтр по темам і категоріям.

-- 3. Вивести книги видавництва 'BHV', видані після 2000 р

-- 4. Вивести загальну кількість сторінок по кожній назві категорії. Фільтр по спадаючій / зростанню кількості сторінок.

-- 5. Вивести середню вартість книг по темі 'Використання ПК' і категорії 'Linux'.

-- 6. Вивести всі дані універсального відношення.

-- 7. Вивести пари книг, що мають однакову кількість сторінок.

-- 8. Вивести тріади книг, що мають однакову ціну.

-- 9. Вивести всі книги категорії 'C ++'.

-- 10. Вивести список видавництв, у яких розмір книг перевищує 400 сторінок.

-- 11. Вивести список категорій за якими більше 3-х книг.

-- 12. Вивести список книг видавництва 'BHV', якщо в списку є хоча б одна книга цього видавництва.

-- 13. Вивести список книг видавництва 'BHV', якщо в списку немає жодної книги цього видавництва.

-- 14. Вивести відсортоване загальний список назв тем і категорій.

-- 15. Вивести відсортований в зворотному порядку загальний список перших слів назв книг і категорій що не повторюються
